RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_mipi_csi_regs.h
/*
 * STATUS_INT_PKT_FATAL (RC)
 *
 * status of int_st_pkt_fatal
 */
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PKT_FATAL_MASK (0x4U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PKT_FATAL_SHIFT (2U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PKT_FATAL_GET(x) (((uint32_t)(x) & MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PKT_FATAL_MASK) >> MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PKT_FATAL_SHIFT)

/*
 * STATUS_INT_PHY_FATAL (RC)
 *
 * status of int_st_phy_fatal
 */
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PHY_FATAL_MASK (0x2U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PHY_FATAL_SHIFT (1U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PHY_FATAL_GET(x) (((uint32_t)(x) & MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PHY_FATAL_MASK) >> MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_PHY_FATAL_SHIFT)

/*
 * STATUS_INT_ST_AP_GENERIC (RC)
 *
 * status of int_st_ap_generic
 */
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_ST_AP_GENERIC_MASK (0x1U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_ST_AP_GENERIC_SHIFT (0U)
#define MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_ST_AP_GENERIC_GET(x) (((uint32_t)(x) & MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_ST_AP_GENERIC_MASK) >> MIPI_CSI_INT_ST_AP_MAIN_STATUS_INT_ST_AP_GENERIC_SHIFT)

/* Bitfield definition for register: PHY_SHUTDOWNZ */
/*
 * PHY_SHUTDOWNZ (RW)
 *
 * shutdown input,active low
 */
#define MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_MASK (0x1U)
#define MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_SHIFT (0U)
#define MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_SET(x) (((uint32_t)(x) << MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_SHIFT) & MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_MASK)
#define MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_MASK) >> MIPI_CSI_PHY_SHUTDOWNZ_PHY_SHUTDOWNZ_SHIFT)

/* Bitfield definition for register: DPHY_RSTZ */
/*
 * DPHY_RSTZ (RW)
 *
 * phy reset output, active low
 */
#define MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_MASK (0x1U)
#define MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_SHIFT (0U)
#define MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_SET(x) (((uint32_t)(x) << MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_SHIFT) & MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_MASK)
#define MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_GET(x) (((uint32_t)(x) & MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_MASK) >> MIPI_CSI_DPHY_RSTZ_DPHY_RSTZ_SHIFT)

/* Bitfield definition for register: PHY_RX */
/*
 * PHY_RXCLKACTIVEHS (RO)
 *
 * indicates the d-phy clock lane is actively receiving a ddr clock
 */
#define MIPI_CSI_PHY_RX_PHY_RXCLKACTIVEHS_MASK (0x20000UL)
#define MIPI_CSI_PHY_RX_PHY_RXCLKACTIVEHS_SHIFT (17U)
#define MIPI_CSI_PHY_RX_PHY_RXCLKACTIVEHS_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_RX_PHY_RXCLKACTIVEHS_MASK) >> MIPI_CSI_PHY_RX_PHY_RXCLKACTIVEHS_SHIFT)

/*
 * PHY_RXULPSCLKNOT (RO)
 *
 * active low. Indicates the d-phy clock lane module has entered the Ultra low power state
 */
#define MIPI_CSI_PHY_RX_PHY_RXULPSCLKNOT_MASK (0x10000UL)
#define MIPI_CSI_PHY_RX_PHY_RXULPSCLKNOT_SHIFT (16U)
#define MIPI_CSI_PHY_RX_PHY_RXULPSCLKNOT_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_RX_PHY_RXULPSCLKNOT_MASK) >> MIPI_CSI_PHY_RX_PHY_RXULPSCLKNOT_SHIFT)

/*
 * PHY_RXULLPSESC_1 (RO)
 *
 * lane module 1 has entered the ultra low power mode
 */
#define MIPI_CSI_PHY_RX_PHY_RXULLPSESC_1_MASK (0x2U)
#define MIPI_CSI_PHY_RX_PHY_RXULLPSESC_1_SHIFT (1U)
#define MIPI_CSI_PHY_RX_PHY_RXULLPSESC_1_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_RX_PHY_RXULLPSESC_1_MASK) >> MIPI_CSI_PHY_RX_PHY_RXULLPSESC_1_SHIFT)

/*
 * PHY_RXULPSESC_0 (RO)
 *
 * lane module 0 has entered the ultra low power mode
 */
#define MIPI_CSI_PHY_RX_PHY_RXULPSESC_0_MASK (0x1U)
#define MIPI_CSI_PHY_RX_PHY_RXULPSESC_0_SHIFT (0U)
#define MIPI_CSI_PHY_RX_PHY_RXULPSESC_0_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_RX_PHY_RXULPSESC_0_MASK) >> MIPI_CSI_PHY_RX_PHY_RXULPSESC_0_SHIFT)

/* Bitfield definition for register: PHY_STOPSTATE */
/*
 * PHY_STOPSTATECLK (RO)
 *
 * d-phy clock lane in stop state
 */
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATECLK_MASK (0x10000UL)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATECLK_SHIFT (16U)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATECLK_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATECLK_MASK) >> MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATECLK_SHIFT)

/*
 * PHY_STOPSTATEDATA_1 (RO)
 *
 * data lane 1 in stop state
 */
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_1_MASK (0x2U)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_1_SHIFT (1U)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_1_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_1_MASK) >> MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_1_SHIFT)

/*
 * PHY_STOPSTATEDATA_0 (RO)
 *
 * data lane 0 in stop state
 */
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_0_MASK (0x1U)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_0_SHIFT (0U)
#define MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_0_GET(x) (((uint32_t)(x) & MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_0_MASK) >> MIPI_CSI_PHY_STOPSTATE_PHY_STOPSTATEDATA_0_SHIFT)

/* Bitfield definition for register: IPI_MODE */
/*
 * IPI_ENABLE (RW)
 *
 * enables the interface
 */
#define MIPI_CSI_IPI_MODE_IPI_ENABLE_MASK (0x1000000UL)
#define MIPI_CSI_IPI_MODE_IPI_ENABLE_SHIFT (24U)
#define MIPI_CSI_IPI_MODE_IPI_ENABLE_SET(x) (((uint32_t)(x) << MIPI_CSI_IPI_MODE_IPI_ENABLE_SHIFT) & MIPI_CSI_IPI_MODE_IPI_ENABLE_MASK)
#define MIPI_CSI_IPI_MODE_IPI_ENABLE_GET(x) (((uint32_t)(x) & MIPI_CSI_IPI_MODE_IPI_ENABLE_MASK) >> MIPI_CSI_IPI_MODE_IPI_ENABLE_SHIFT)

/*
 * IPI_CUT_THROUGH (RW)
 *
 * cut-through mode state active when high
 */
#define MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_MASK (0x10000UL)
#define MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_SHIFT (16U)
#define MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_SET(x) (((uint32_t)(x) << MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_SHIFT) & MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_MASK)
#define MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_GET(x) (((uint32_t)(x) & MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_MASK) >> MIPI_CSI_IPI_MODE_IPI_CUT_THROUGH_SHIFT)

/*
 * IPI_COLOR_COM (RW)
 *
 * if color mode components are deliverd as follows: 0x0 48bit intercase  0x1: 16bit interface
 */
#define MIPI_CSI_IPI_MODE_IPI_COLOR_COM_MASK (0x100U)
#define MIPI_CSI_IPI_MODE_IPI_COLOR_COM_SHIFT (8U)
#define MIPI_CSI_IPI_MODE_IPI_COLOR_COM_SET(x) (((uint32_t)(x) << MIPI_CSI_IPI_MODE_IPI_COLOR_COM_SHIFT) & MIPI_CSI_IPI_MODE_IPI_COLOR_COM_MASK)
#define MIPI_CSI_IPI_MODE_IPI_COLOR_COM_GET(x) (((uint32_t)(x) & MIPI_CSI_IPI_MODE_IPI_COLOR_COM_MASK) >> MIPI_CSI_IPI_MODE_IPI_COLOR_COM_SHIFT)

